axf33480/ESP32CommandStation/main/Interfaces/WebServer.cpp
void to_json(nlohmann::json& j, const wifi_ap_record_t& t)
{
  j = nlohmann::json({
    { JSON_WIFI_SSID_NODE, (char *)t.ssid },
    { JSON_WIFI_RSSI_NODE, t.rssi },
    { JSON_WIFI_AUTH_NODE, t.authmode },
  });
}

WEBSOCKET_STREAM_HANDLER_IMPL(process_websocket_event, client, event, data
                            , data_len)
{
  OSMutexLock h(&webSocketLock);
  if (event == WebSocketEvent::WS_EVENT_CONNECT)
  {
    webSocketClients.push_back(
      std::make_unique<WebSocketClient>(client->id(), client->ip()));
  }
  else if (event == WebSocketEvent::WS_EVENT_DISCONNECT)
  {
    webSocketClients.erase(std::remove_if(webSocketClients.begin()
                                        , webSocketClients.end()
    , [client](unique_ptr<WebSocketClient> &inst) -> bool
      {
        return inst->id() == client->id();
      }));
  }
  else if (event == WebSocketEvent::WS_EVENT_TEXT)
  {
    auto ent = std::find_if(webSocketClients.begin(), webSocketClients.end()
    , [client](unique_ptr<WebSocketClient> &inst) -> bool
      {
        return inst->id() == client->id();
      }
    );
    if (ent != webSocketClients.end())
    {
      // TODO: remove cast that drops const
      auto res = (*ent)->feed((uint8_t *)data, data_len);
      if (res.length())
      {
        client->send_text(res);
      }
    }
  }
}

esp_ota_handle_t otaHandle;
esp_partition_t *ota_partition = nullptr;
HTTP_STREAM_HANDLER_IMPL(process_ota, request, filename, size, data, length
                       , offset, final, abort_req)
{
  esp_err_t err = ESP_OK;
  if (!offset)
  {
    esp_log_level_set("esp_image", ESP_LOG_VERBOSE);
    ota_partition = (esp_partition_t *)esp_ota_get_next_update_partition(NULL);
    err = ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_begin(ota_partition, size
                                                    , &otaHandle));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA start failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA Update starting (%zu bytes, target:%s)...", size
      , ota_partition->label);
    Singleton<RMTTrackDevice>::instance()->disable_ops_output();
    Singleton<RMTTrackDevice>::instance()->disable_prog_output();
    Singleton<OTAMonitorFlow>::instance()->report_start();
  }
  HASSERT(ota_partition);
  ESP_ERROR_CHECK(esp_ota_write(otaHandle, data, length));
  Singleton<OTAMonitorFlow>::instance()->report_progress(length);
  if (final)
  {
    err = ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_end(otaHandle));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA end failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA binary received, setting boot partition: %s"
      , ota_partition->label);
    err = ESP_ERROR_CHECK_WITHOUT_ABORT(
      esp_ota_set_boot_partition(ota_partition));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA end failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA Update Complete!");
    Singleton<OTAMonitorFlow>::instance()->report_success();
    request->set_status(HttpStatusCode::STATUS_OK);
    return new StringResponse("OTA Upload Complete", MIME_TYPE_TEXT_PLAIN);
  }
  return nullptr;
}

HTTP_HANDLER_IMPL(process_power, request)
{
  string response = "{}";
  request->set_status(HttpStatusCode::STATUS_OK);
  if (request->method() == HttpMethod::GET)
  {
    response.assign(Singleton<RMTTrackDevice>::instance()->generate_status_json());
  }
  else if (request->method() == HttpMethod::PUT)
  {
    if (request->param(JSON_STATE_NODE, false))
    {
      Singleton<RMTTrackDevice>::instance()->enable_ops_output();
    }
    else
    {
      Singleton<RMTTrackDevice>::instance()->disable_ops_output();
      Singleton<RMTTrackDevice>::instance()->disable_prog_output();
    }
  }
  return new StringResponse(response, MIME_TYPE_APPLICATION_JSON);
}

HTTP_HANDLER_IMPL(process_config, request)
{
  bool needReboot = false;
  if (request->has_param("reset"))
  {
    Singleton<ConfigurationManager>::instance()->factory_reset();
    needReboot = true;
  }
  else if (request->has_param("scan"))
  {
    SyncNotifiable n;
    Esp32WiFiManager *wifi_mgr = Singleton<Esp32WiFiManager>::instance();
    wifi_mgr->start_ssid_scan(&n);
    n.wait_for_notification();
    size_t num_found = wifi_mgr->get_ssid_scan_result_count();
    nlohmann::json ssid_list;
    vector<string> seen_ssids;
    for (int i = 0; i < num_found; i++)
    {
      auto entry = wifi_mgr->get_ssid_scan_result(i);
      if (std::find_if(seen_ssids.begin(), seen_ssids.end()
        , [entry](string &s)
          {
            return s == (char *)entry.ssid;
          }) != seen_ssids.end())
      {
        // filter duplicate SSIDs
        continue;
      }
      seen_ssids.push_back((char *)entry.ssid);
      ssid_list.push_back(entry);
    }
    wifi_mgr->clear_ssid_scan_results();
    return new StringResponse(ssid_list.dump(), MIME_TYPE_APPLICATION_JSON);
  }
  if (request->has_param("ssid") &&
      Singleton<ConfigurationManager>::instance()->setWiFiStationParams(request->param("ssid")
                                      , request->param("password")))
  {
    needReboot = true;
  }
  if (request->has_param("mode") &&
      Singleton<ConfigurationManager>::instance()->setWiFiMode(request->param("mode")))
  {
    needReboot = true;
  }
  if (request->has_param("nodeid") &&
      Singleton<ConfigurationManager>::instance()->setNodeID(request->param("nodeid")))
  {
    needReboot = true;
  }
  if (request->has_param("lcc-can") &&
      Singleton<ConfigurationManager>::instance()->setLCCCan(request->param("lcc-can", false)))
  {
    needReboot = true;
  }
  if (request->has_param("lcc-hub"))
  {
    Singleton<ConfigurationManager>::instance()->setLCCHub(request->param("lcc-hub", false));
  }
  if (request->has_param("uplink-mode") && request->has_param("uplink-service") &&
      request->has_param("uplink-manual") && request->has_param("uplink-manual-port"))
  {
    // WiFi uplink settings do not require a reboot
    Singleton<ConfigurationManager>::instance()->setWiFiUplinkParams((SocketClientParams::SearchMode)request->param("uplink-mode"
                                    , SocketClientParams::SearchMode::AUTO_MANUAL)
                                    , request->param("uplink-service")
                                    , request->param("uplink-manual")
                                    , request->param("uplink-manual-port"
                                                   , openlcb::TcpClientDefaultParams::DEFAULT_PORT));
  }
  if (request->has_param("ops-short") && request->has_param("ops-short-clear") &&
      request->has_param("ops-shutdown") && request->has_param("ops-shutdown-clear") &&
      request->has_param("ops-thermal") && request->has_param("ops-thermal-clear"))
  {
    Singleton<ConfigurationManager>::instance()->setHBridgeEvents(OPS_CDI_TRACK_OUTPUT_INDEX
                                , request->param("ops-short")
                                , request->param("ops-short-clear")
                                , request->param("ops-shutdown")
                                , request->param("ops-shutdown-clear")
                                , request->param("ops-thermal")
                                , request->param("ops-thermal-clear"));
  }
  if (request->has_param("prog-short") && request->has_param("prog-short-clear") &&
      request->has_param("prog-shutdown") && request->has_param("prog-shutdown-clear"))
  {
    Singleton<ConfigurationManager>::instance()->setHBridgeEvents(PROG_CDI_TRACK_OUTPUT_INDEX
                                , request->param("prog-short")
                                , request->param("prog-short-clear")
                                , request->param("prog-shutdown")
                                , request->param("prog-shutdown-clear"));
  }

  if (needReboot)
  {
    // send a string back to the client rather than SEND_GENERIC_RESPONSE
    // so we don't return prior to calling reboot.
    return new StringResponse("{restart:\"ESP32CommandStation Restarting!\"}"
                            , MIME_TYPE_APPLICATION_JSON);
  }

  return new StringResponse(Singleton<ConfigurationManager>::instance()->getCSConfig()
                          , MIME_TYPE_APPLICATION_JSON);
}

HTTP_HANDLER_IMPL(process_prog, request)
{
  request->set_status(HttpStatusCode::STATUS_OK);
  if (!request->has_param(JSON_PROG_ON_MAIN))
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
  }
  else if (request->method() == HttpMethod::GET)
  {
    if (request->param(JSON_PROG_ON_MAIN, false))
    {
      request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
    }
    else if(request->has_param(JSON_IDENTIFY_NODE))
    {
      int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
      if (decoderConfig > 0)
      {
        uint16_t decoderAddress = 0;
        string response = "{";
        if ((decoderConfig & DECODER_CONFIG_BITS::DECODER_TYPE) == DECODER_CONFIG_BITS::DECODER_TYPE)
        {
          uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
          int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
          int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
          if (addrMSB >= 0 && addrLSB >= 0)
          {
            if (decoderManufacturer == 0xA5)
            {
              // MERG uses 7 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
            }
            else if(decoderManufacturer == 0x19)
            {
              // Team Digital uses 8 bit LSB and 4 bit MSB
              decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
            }
            else
            {
              // NMRA spec shows 6 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
            }
            response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                   , JSON_VALUE_LONG_ADDRESS);
          }
          else
          {
            LOG(WARNING, "Failed to read address MSB/LSB");
            request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
          }
        }
        else
        {
          if ((decoderConfig & DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS) == DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS)
          {
            int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
            if (addrMSB >= 0 && addrLSB >= 0)
            {
              decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_LONG_ADDRESS);

