axf33480/ESP32CommandStation/main/Interfaces/WebServer.cpp
            }
            else
            {
              LOG(WARNING, "Unable to read address MSB/LSB");
              request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
            }
          }
          else
          {
            int16_t shortAddr = readCV(CV_NAMES::SHORT_ADDRESS);
            if (shortAddr > 0)
            {
              decoderAddress = shortAddr;
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_SHORT_ADDRESS);
            }
            else
            {
              LOG(WARNING, "Unable to read short address CV");
              request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
            }
          }
          response += StringPrintf("\"%s\":%s,", JSON_SPEED_TABLE_NODE
                                 , (decoderConfig & DECODER_CONFIG_BITS::SPEED_TABLE) == DECODER_CONFIG_BITS::SPEED_TABLE ?
                                           JSON_VALUE_ON : JSON_VALUE_OFF);
        }
        response += StringPrintf("\"%s\":%d,", JSON_ADDRESS_NODE
                               , decoderAddress);
        // if it is a mobile decoder *AND* we are requested to create it, send
        // the decoder address to the train db to create an entry.
        if (request->param(JSON_CREATE_NODE, false) &&
           (decoderConfig & BIT(DECODER_CONFIG_BITS::DECODER_TYPE)) == 0)
        {
          auto traindb = Singleton<esp32cs::Esp32TrainDatabase>::instance();
          traindb->create_if_not_found(decoderAddress);
        }
        response += "}";
        return new StringResponse(response, MIME_TYPE_APPLICATION_JSON);
      }
      else
      {
        LOG(WARNING, "Failed to read decoder configuration");
        request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      }
    }
    else
    {
      uint16_t cvNumber = request->param(JSON_CV_NODE, 0);
      if (cvNumber == 0)
      {
        request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      }
      else
      {
        int16_t cvValue = readCV(cvNumber);
        if (cvValue < 0)
        {
          request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
        }
        else
        {
          return new StringResponse(
            StringPrintf("{\"%s\":%d,\"%s\":%d}"
                      , JSON_CV_NODE, cvNumber
                      , JSON_VALUE_NODE, cvValue)
          , MIME_TYPE_APPLICATION_JSON);
        }
      }
    }
  }
  else if (request->method() == HttpMethod::POST)
  {
    uint16_t cv_num = request->param(JSON_CV_NODE, 0);
    uint16_t cv_value = 0;
    uint8_t cv_bit = request->param(JSON_CV_BIT_NODE, 0);
    bool pom = request->param(JSON_PROG_ON_MAIN, false);
    if (request->has_param(JSON_CV_BIT_NODE))
    {
      cv_value = request->param(JSON_VALUE_NODE, false);
    }
    else
    {
      cv_value = request->param(JSON_VALUE_NODE, 0);
    }

    if (cv_num == 0)
    {
      request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
    }
    else if (pom)
    {
      uint16_t address = request->param(JSON_ADDRESS_NODE, 0);
      if (request->has_param(JSON_CV_BIT_NODE))
      {
        writeOpsCVBit(address, cv_num, cv_bit, cv_value);
      }
      else
      {
        writeOpsCVByte(address, cv_num, cv_value);
      }
    }
    else if (request->has_param(JSON_CV_BIT_NODE) &&
             !writeProgCVBit(cv_num, cv_bit,cv_value))
    {
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
    }
    else if (!writeProgCVByte(cv_num, cv_value))
    {
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
    }
  }
  return nullptr;
}

// GET /turnouts - full list of turnouts, note that turnout state is STRING type for display
// GET /turnouts?readbleStrings=[0,1] - full list of turnouts, turnout state will be returned as true/false (boolean) when readableStrings=0.
// GET /turnouts?address=<address> - retrieve turnout by DCC address
// GET /turnouts?id=<id> - retrieve turnout by ID
// PUT /turnouts?address=<address> - toggle turnout by DCC address
// PUT /turnouts?id=<id> - toggle turnout by ID
// POST /turnouts?id=<id>&address=<address>&subAddress=<subAddress>&type=<type> - creates a new turnout
//      when id is -1 it will be auto-assigned as number of defined turnouts + 1.
//      if subAddress is -1 the turnout will be defined as DCC address only.
// DELETE /turnouts?id=<id> - delete turnout by ID
// DELETE /turnouts?address=<address> - delete turnout by DCC address
//
// For successful requests the result code will be 200 and either an array of turnouts or single turnout will be returned.
// For unsuccessful requests the result code will be 400 (bad request, missing args), 401 (not found), 500 (server failure).
//
HTTP_HANDLER_IMPL(process_turnouts, request)
{
  request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
  if (request->method() == HttpMethod::GET &&
     !request->has_param(JSON_ID_NODE) &&
     !request->has_param(JSON_ADDRESS_NODE))
  {
    bool readable = true;
    if (request->has_param(JSON_TURNOUTS_READABLE_STRINGS_NODE))
    {
      readable = request->param(JSON_TURNOUTS_READABLE_STRINGS_NODE, 0);
    }
    return new StringResponse(Singleton<TurnoutManager>::instance()->getStateAsJson(readable)
                            , MIME_TYPE_APPLICATION_JSON);
  }

  int16_t id = request->param(JSON_ID_NODE, -1);
  uint16_t address = request->param(JSON_ADDRESS_NODE, 0);
  uint16_t subaddress = request->param(JSON_SUB_ADDRESS_NODE, 0);
  if (request->method() == HttpMethod::GET)
  {
    if (request->has_param(JSON_ID_NODE))
    {
      auto turnout = Singleton<TurnoutManager>::instance()->getTurnoutByID(id);
      if (turnout)
      {
        return new StringResponse(turnout->toJson()
                                , MIME_TYPE_APPLICATION_JSON);
      }
      request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
    }
    else
    {
      auto turnout = Singleton<TurnoutManager>::instance()->getTurnoutByID(address);
      if (turnout)
      {
        return new StringResponse(turnout->toJson()
                                , MIME_TYPE_APPLICATION_JSON);
      }
      request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
    }
  }
  else if (request->method() == HttpMethod::POST)
  {
    TurnoutType type = (TurnoutType)request->param(JSON_TYPE_NODE
                                                 , TurnoutType::LEFT);
    // auto generate ID
    if (id == -1)
    {
      id = Singleton<TurnoutManager>::instance()->getTurnoutCount() + 1;
    }
    auto turnout = Singleton<TurnoutManager>::instance()->createOrUpdate((uint16_t)id, address
                                                , subaddress, type);
    if (turnout)
    {
      return new StringResponse(turnout->toJson(), MIME_TYPE_APPLICATION_JSON);
    }
    request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
  }
  else if (request->method() == HttpMethod::DELETE)
  {
    if (request->has_param(JSON_ID_NODE) && Singleton<TurnoutManager>::instance()->removeByID(id))
    {
      request->set_status(HttpStatusCode::STATUS_OK);
    }
    else if (Singleton<TurnoutManager>::instance()->removeByAddress(address))
    {
      request->set_status(HttpStatusCode::STATUS_OK);
    }
  }
  else if (request->method() == HttpMethod::PUT)
  {
    if (request->has_param(JSON_ID_NODE))
    {
      Singleton<TurnoutManager>::instance()->toggleByID(id);
    }
    else
    {
      Singleton<TurnoutManager>::instance()->toggleByAddress(address);
    }
    request->set_status(HttpStatusCode::STATUS_OK);
  }
  return nullptr;
}

string convert_loco_to_json(openlcb::TrainImpl *t)
{
  if (!t)
  {
    return "{}";
  }
  nlohmann::json j =
  {
    { JSON_ADDRESS_NODE, t->legacy_address() },
    { JSON_SPEED_NODE, t->get_speed().get_dcc_128() & 0x7F },
    { JSON_DIRECTION_NODE, t->get_speed().direction() ? JSON_VALUE_REVERSE : JSON_VALUE_FORWARD},
  };
  for(uint8_t funcID = 0; funcID < DCC_MAX_FN; funcID++)
  {
    j[JSON_FUNCTIONS_NODE].push_back({
      { JSON_ID_NODE, funcID },
      { JSON_STATE_NODE, t->get_fn(funcID) }
    });
  }
  return j.dump();
}

#define GET_LOCO_VIA_EXECUTOR(NAME, address)                                          \
  openlcb::TrainImpl *NAME = nullptr;                                                 \
  {                                                                                   \
    SyncNotifiable n;                                                                 \
    lccStack->executor()->add(new CallbackExecutable(                                 \
    [&]()                                                                             \
    {                                                                                 \
      NAME = Singleton<commandstation::AllTrainNodes>::instance()->get_train_impl(    \
                                        commandstation::DccMode::DCC_128_LONG_ADDRESS \
                                      , address);                                     \
      n.notify();                                                                     \
    }));                                                                              \
    n.wait_for_notification();                                                        \
  }

// method - url pattern - meaning
// ANY /locomotive/estop - send emergency stop to all locomotives
// GET /locomotive/roster - roster
// GET /locomotive/roster?address=<address> - get roster entry
// PUT /locomotive/roster?address=<address> - update roster entry
// POST /locomotive/roster?address=<address> - create roster entry
// DELETE /locomotive/roster?address=<address> - delete roster entry
// GET /locomotive - get active locomotives
// POST /locomotive?address=<address> - add locomotive to active management
// GET /locomotive?address=<address> - get locomotive state
// PUT /locomotive?address=<address>&speed=<speed>&dir=[FWD|REV]&fX=[true|false] - Update locomotive state, fX is short for function X where X is 0-28.
// DELETE /locomotive?address=<address> - removes locomotive from active management
HTTP_HANDLER_IMPL(process_loco, request)
{
  string url = request->uri();
  auto traindb = Singleton<esp32cs::Esp32TrainDatabase>::instance();
  request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);

  // check if we have an eStop command, we don't care how this gets sent to the
  // command station (method) so check it first
  if(url.find("/estop") != string::npos)
  {
    Singleton<esp32cs::EStopHandler>::instance()->set_state(true);
    request->set_status(HttpStatusCode::STATUS_OK);
  }
  else if(url.find("/roster")  != string::npos)
  {
    if(request->method() == HttpMethod::GET &&
       !request->has_param(JSON_ADDRESS_NODE))
    {
      return new StringResponse(
        Singleton<esp32cs::Esp32TrainDatabase>::instance()->get_all_entries_as_json()
      , MIME_TYPE_APPLICATION_JSON);
    }
    else if (request->has_param(JSON_ADDRESS_NODE))
    {
      if(request->method() == HttpMethod::DELETE)
      {
        traindb->delete_entry(request->param(JSON_ADDRESS_NODE, 0));
        request->set_status(HttpStatusCode::STATUS_OK);
      }
      else
      {
        uint16_t address = request->param(JSON_ADDRESS_NODE, 0);
        traindb->create_if_not_found(address);
        if(request->method() == HttpMethod::PUT ||
           request->method() == HttpMethod::POST)
        {
          if(request->has_param(JSON_NAME_NODE))
          {
            string name = request->param(JSON_NAME_NODE);
            traindb->set_train_name(address, name);
          }
          if(request->has_param(JSON_IDLE_ON_STARTUP_NODE))
          {
            traindb->set_train_auto_idle(address
                                       , request->param(JSON_IDLE_ON_STARTUP_NODE
                                                      , false));
          }
          if(request->has_param(JSON_DEFAULT_ON_THROTTLE_NODE))
          {
            bool value = request->param(JSON_DEFAULT_ON_THROTTLE_NODE, false);
            traindb->set_train_show_on_limited_throttle(address, value);
          }
        }
        return new StringResponse(traindb->get_entry_as_json(address)
                                , MIME_TYPE_APPLICATION_JSON);
      }
    }
  }
  else
  {
    // Since it is not an eStop or roster command we need to check the request
    // method and ensure it contains the required arguments otherwise the
    // request should be rejected
    if(request->method() == HttpMethod::GET && 
       !request->has_param(JSON_ADDRESS_NODE))
    {
      // get all active locomotives
      string res = "[";
      auto trains = Singleton<commandstation::AllTrainNodes>::instance();
      for (size_t id = 0; id < trains->size(); id++)
      {
        auto nodeid = trains->get_train_node_id(id);
        if (nodeid)
        {
          if (res.length() > 1)
          {
            res += ",";
          }
          auto loco = trains->get_train_impl(nodeid);
          res += convert_loco_to_json(loco);
        }
      }
      res += "]";
      return new StringResponse(res, MIME_TYPE_APPLICATION_JSON);
    }
    else if (request->has_param(JSON_ADDRESS_NODE))
    {
      uint16_t address = request->param(JSON_ADDRESS_NODE, 0);
      if(request->method() == HttpMethod::PUT ||
         request->method() == HttpMethod::POST)
      {
        GET_LOCO_VIA_EXECUTOR(loco, address);
        auto upd_speed = loco->get_speed();
        // Creation / Update of active locomotive
        if(request->has_param(JSON_IDLE_NODE))
        {
          upd_speed.set_dcc_128(0);
        }
        if(request->has_param(JSON_SPEED_NODE))
        {
          upd_speed.set_dcc_128(request->param(JSON_SPEED_NODE, 0));
        }
        if(request->has_param(JSON_DIRECTION_NODE))
        {
          bool forward =
            !request->param(JSON_DIRECTION_NODE).compare(JSON_VALUE_FORWARD);
          upd_speed.set_direction(forward ? dcc::SpeedType::FORWARD
                                          : dcc::SpeedType::REVERSE);
        }
        loco->set_speed(upd_speed);
        for(uint8_t funcID = 0; funcID <=28 ; funcID++)
        {
          string fArg = StringPrintf("f%d", funcID);
          if(request->has_param(fArg.c_str()))
          {
            loco->set_fn(funcID, request->param(fArg, false));
          }
        }
        return new StringResponse(convert_loco_to_json(loco)
                                , MIME_TYPE_APPLICATION_JSON);
      }
      else if(request->method() == HttpMethod::DELETE)
      {
        // we don't need to queue it up on the executor as it is done internally.
        Singleton<commandstation::AllTrainNodes>::instance()->remove_train_impl(address);
#if NEXTION_ENABLED
        static_cast<NextionThrottlePage *>(nextionPages[THROTTLE_PAGE])->invalidateLocomotive(address);
#endif
        request->set_status(HttpStatusCode::STATUS_NO_CONTENT);
      }
      else
      {
        GET_LOCO_VIA_EXECUTOR(loco, address);
        return new StringResponse(convert_loco_to_json(loco)
                                , MIME_TYPE_APPLICATION_JSON);
      }
    }
  }
  return nullptr;
}

#if ENABLE_OUTPUTS
HTTP_HANDLER_IMPL(process_outputs, request)
{
  if (request->method() == HttpMethod::GET && !request->params())
  {
    return new StringResponse(OutputManager::getStateAsJson()
                            , MIME_TYPE_APPLICATION_JSON);
  }
  request->set_status(HttpStatusCode::STATUS_OK);
  int16_t output_id = request->param(JSON_ID_NODE, -1);
  if (output_id < 0)
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
  }
  else if (request->method() == HttpMethod::GET)
  {
    auto output = OutputManager::getOutput(output_id);
    if (output)
    {
      return new StringResponse(output->toJson(), MIME_TYPE_APPLICATION_JSON);
    }
    request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
  }
  else if (request->method() == HttpMethod::POST)
  {
    int8_t pin = request->param(JSON_PIN_NODE, -1);
    bool inverted = request->param(JSON_INVERTED_NODE, false);
    bool forceState = request->param(JSON_FORCE_STATE_NODE, false);
    bool defaultState = request->param(JSON_DEFAULT_STATE_NODE, false);
    uint8_t outputFlags = 0;
    if (inverted)
    {
      bitSet(outputFlags, OUTPUT_IFLAG_INVERT);
    }
    if (forceState)
    {
      bitSet(outputFlags, OUTPUT_IFLAG_RESTORE_STATE);
      if (defaultState)
      {
        bitSet(outputFlags, OUTPUT_IFLAG_FORCE_STATE);
      }
    }
    if (pin < 0)
    {
      request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
    }
    else if (!OutputManager::createOrUpdate(output_id, pin, outputFlags))
    {
      request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
    }
  }
  else if (request->method() == HttpMethod::DELETE &&
          !OutputManager::remove(output_id))
  {
    request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
  }
  else if(request->method() == HttpMethod::PUT)
  {
    OutputManager::toggle(output_id);
  }
  return nullptr;
}
#endif // ENABLE_OUTPUTS

#if ENABLE_SENSORS
HTTP_HANDLER_IMPL(process_sensors, request)
{
  request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
  if (request->method() == HttpMethod::GET &&
      !request->has_param(JSON_ID_NODE))
  {
    return new StringResponse(SensorManager::getStateAsJson()
                            , MIME_TYPE_APPLICATION_JSON);
  }
  else if (!request->has_param(JSON_ID_NODE))
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
  }
  else
  {
    int16_t id = request->param(JSON_ID_NODE, -1);
    if (id < 0)
    {
      request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
    }
    else if (request->method() == HttpMethod::GET)
    {
      auto sensor = SensorManager::getSensor(id);
      if (sensor)
      {
        return new StringResponse(sensor->toJson()
                                , MIME_TYPE_APPLICATION_JSON);
      }
      request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
    }
    else if (request->method() == HttpMethod::POST)
    {
      int8_t pin = request->param(JSON_PIN_NODE, -1);
      bool pull = request->param(JSON_PULLUP_NODE, false);
      if (pin < 0)
      {
        request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      }
      else if (!SensorManager::createOrUpdate(id, pin, pull))
      {
        request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
      }
      else
      {
        request->set_status(HttpStatusCode::STATUS_OK);
      }
    }
    else if (request->method() == HttpMethod::DELETE)
    {
      if (SensorManager::getSensorPin(id) < 0)
      {
        // attempt to delete S88/RemoteSensor
        request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
      }
      else if (!SensorManager::remove(id))
      {
        request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
      }
      else
      {
        request->set_status(HttpStatusCode::STATUS_OK);
      }
    }
  }
  
  return nullptr;
}

HTTP_HANDLER_IMPL(process_remote_sensors, request)
{
  request->set_status(HttpStatusCode::STATUS_OK);
  if(request->method() == HttpMethod::GET)
  {
    return new StringResponse(RemoteSensorManager::getStateAsJson()
                            , MIME_TYPE_APPLICATION_JSON);
  }
  else if(request->method() == HttpMethod::POST)
  {
    RemoteSensorManager::createOrUpdate(request->param(JSON_ID_NODE, 0),
                                        request->param(JSON_VALUE_NODE, 0));
  }
  else if(request->method() == HttpMethod::DELETE)
  {
    RemoteSensorManager::remove(request->param(JSON_ID_NODE, 0));
  }
  return nullptr;
}

#if S88_ENABLED
HTTP_HANDLER_IMPL(process_s88, request)
{
  request->set_status(HttpStatusCode::STATUS_OK);
  if(request->method() == HttpMethod::GET)
  {
    return new StringResponse(S88BusManager::getStateAsJson()
                            , MIME_TYPE_APPLICATION_JSON);
  }
  else if(request->method() == HttpMethod::POST)
  {
    if(!S88BusManager::createOrUpdateBus(
      request->param(JSON_ID_NODE, 0),
      request->param(JSON_PIN_NODE, 0),
      request->param(JSON_COUNT_NODE, 0)))
    {
      // duplicate pin/id
      request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
    }
  }
  else if(request->method() == HttpMethod::DELETE)
  {
    S88BusManager::removeBus(request->param(JSON_ID_NODE, 0));
  }
  return nullptr;
}
#endif // S88_ENABLED

#endif // ENABLE_SENSORS
